//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include "cquadric.h"
#include "cstep.h"
#include <memory>

//****************************************************************************************************
//глобальные переменные
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//конструктор и деструктор
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//конструктор
//----------------------------------------------------------------------------------------------------
CQuadric::CQuadric(void)
{
}

//----------------------------------------------------------------------------------------------------
//деструктор
//----------------------------------------------------------------------------------------------------
CQuadric::~CQuadric()
{
}
//****************************************************************************************************
//закрытые функции
//****************************************************************************************************

//****************************************************************************************************
//открытые функции
//****************************************************************************************************

//----------------------------------------------------------------------------------------------------
//выполнить интерполяцию
//----------------------------------------------------------------------------------------------------
bool CQuadric::Execute(const std::vector<CGrPoint> &input,std::vector<CGrPoint> &output,long double step)
{
 size_t size=input.size();
 output.clear();
 std::vector<CGrPoint> empty;
 output.swap(empty);

 if (size<3) return(false);//невозможно использовать квадратичную интерполяцию
 if (step==0) return(false);//чёткий ноль использовать нельзя
 size_t min_amount=(input[size-1].X-input[0].X)/step+1;
 output.reserve(min_amount);

 //вычисляем полином в заданных точках
 CStep cStep(size-3,step,input);
 long double x;
 size_t point;

 bool first_step=true;
 //коэффициенты полинома
 long double a;
 long double b;
 long double c;

 while(1)
 {
  bool change_point=cStep.UpdatePoint();
  cStep.GetPos(x,point);
  if (change_point==true || first_step==true)//требуется пересчитать полином
  {
   first_step=false;

   float y0=input[point].Y;
   float x0=input[point].X;

   float y1=input[point+1].Y;
   float x1=input[point+1].X;

   float y2=input[point+2].Y;
   float x2=input[point+2].X;

   a=(y2-y0)/((x2-x0)*(x2-x1));
   a-=(y1-y0)/((x1-x0)*(x2-x1));
   b=(y1-y0)/(x1-x0);
   b-=a*(x1+x0);
   c=y0-b*x0-a*x0*x0;
  }
  long double y=a*x*x+b*x+c;
  output.push_back(CGrPoint(x,y));
  if (cStep.NextStep()==false) break;
 }
 return(true);
}

